Revit 2027 API
CustomFieldData.SetCustomFieldProperties Method
 Sets an instance of ICustomFieldProperties which represents the properties of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCustomFieldProperties(
	ICustomFieldProperties customFieldProperties
)
Public Sub SetCustomFieldProperties (
	customFieldProperties As ICustomFieldProperties
)
public:
void SetCustomFieldProperties(
	ICustomFieldProperties^ customFieldProperties
)
member SetCustomFieldProperties :
        customFieldProperties : ICustomFieldProperties -> unit
Parameters
customFieldProperties ICustomFieldProperties
 An instance of ICustomFieldProperties which represents the properties of this field.
Exceptions
Exception | Condition
ArgumentException |  The input properties are not valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Can't set the properties to a CustomFieldData of a SchedulableField (which is not added to a schedule).
See Also
Reference
CustomFieldData Class
Autodesk.Revit.DB Namespace